-- 엘모라드 영웅 동상 
-- 그냥 닫기 168

-- EVENT 는 100번 이상 부터 사용

-- UID : 서버에서 제공하는 유저번호
-- EVENT : 서버에서 제공하는 퀘스트 번호
-- STEP : 서버에서 제공하는 퀘스트 내부 단계

-- 위의 세가지 파라메타는 루아 실행시 항상 전역변수로 제공�

-- 지역변수 선언...
local UserClass;
local QuestNum;
local Ret = 0;
local NPC =16074;

-- 엘모라드 영웅 동상  클릭시 퀘스트 체크  

if EVENT == 168 then -- 그냥 닫기 
    Ret = 1;
end


if EVENT == 165 then
    SelectMsg(UID, 3, -1, 4480, NPC, 4201, 4201, 4202, 4202, 4203, 4203, 4204, 4204, 4205, 4205, 4206, 4206, 4207, 4207, 4208, 4208, 4209, 4209, 4210, 4210, 4211, 4211, -1, -1);        
end

if EVENT == 4201 then
    SelectMsg(UID, 2, -1, 4492, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4202 then
    SelectMsg(UID, 2, -1, 4493, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4203 then
    SelectMsg(UID, 2, -1, 4494, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4204 then
    SelectMsg(UID, 2, -1, 4495, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4205 then
    SelectMsg(UID, 2, -1, 4496, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4206 then
    SelectMsg(UID, 2, -1, 4497, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4207 then
    SelectMsg(UID, 2, -1, 4498, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4208 then
    SelectMsg(UID, 2, -1, 4499, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4209 then
    SelectMsg(UID, 2, -1, 4500, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4210 then
    SelectMsg(UID, 2, -1, 4501, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end

if EVENT == 4211 then
    SelectMsg(UID, 2, -1, 4502, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);        
end
