-- [행상] 헤메스
-- 그냥 닫기 168

-- EVENT 는 100번 이상 부터 사용

-- UID : 서버에서 제공하는 유저번호
-- EVENT : 서버에서 제공하는 퀘스트 번호
-- STEP : 서버에서 제공하는 퀘스트 내부 단계

-- 위의 세가지 파라메타는 루아 실행시 항상 전역변수로 제공?

-- 지역변수 선언...
local UserClass;
local QuestNum;
local Ret = 0;
local NPC =16085;


-- [행상] 헤메스 클릭시 퀘스트 체크  
--SelectMsg(UID, 4, 429, 8236, NPC, 22, 303, 23, 1004, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);

if EVENT == 165 then
	QuestNum = SearchQuest(UID, NPC);
		if QuestNum == 0 then --해당 NPC에게 할수 있는 퀘스트가 0개 일때 
			 SelectMsg(UID, 2, -1, 4130, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
			 Ret = 1;
		elseif QuestNum > 1 and QuestNum < 100 then--해당 NPC에게 할수 있는 퀘스트가 1개 일때 
          NpcMsg(UID, 4131, NPC)
      else--해당 NPC에게 할수 있는 퀘스트가 1개 이상 일때 
          EVENT = QuestNum
		end
end

if EVENT == 850 then
	SelectMsg(UID, 2, -1, 4130, NPC, 4286, 168, 4287, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 168 then -- 그냥 닫기 
    Ret = 1;
end

--******************************************************--
-- 아이디 변경 시작

local savenum = 426
--******************************************************--
if EVENT == 200 then
   ITEM_COUNTA = HowmuchItem(UID, 800032000); -- 아이디 변경 아이템 
    if ITEM_COUNTA > 0 then
    ChangeName(UID)
    else
    SelectMsg(UID, 2, savenum, 4454, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    end
end

--******************************************************--
-- 아이디 변경  끝
--******************************************************--

--******************************************************--
-- 클랜 아이디 변경 시작

local savenum = 450
--******************************************************--
if EVENT == 600 then
   ITEM_COUNTA = HowmuchItem(UID, 800086000); -- 클랜 아이디 변경 아이템 
    if ITEM_COUNTA > 0 then
        Chief = CheckChief(UID)
        if Chief == 1 then -- 클랜단장일때 
        ChangeClanName(UID)
        else-- 클랜단장 아닐때
        SelectMsg(UID, 2, savenum, 4671, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
        end
    else
    SelectMsg(UID, 2, savenum, 4670, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    end
end

--******************************************************--
-- 클랜 아이디 변경  끝
--******************************************************--


--******************************************************--
-- 재분배 시작(고급)

local savenum = 427
--******************************************************--
if EVENT == 300 then
   ITEM_COUNTA = HowmuchItem(UID, 700001000); -- 아이디 변경 아이템 
    if ITEM_COUNTA > 0 then
    SelectMsg(UID, 2, savenum, 4456, NPC, 4189, 301, 4190, 302, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    else
    SelectMsg(UID, 2, savenum, 4455, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    end
end

local Skill
local Stat

if EVENT == 301 then --스킬
    Skill = SkillPointFree(UID)
    if Skill == 1 then    
    RobItem(UID, 700001000, 1);
    SelectMsg(UID, 2, savenum, 4473, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);   
    else
    Ret = 1;
    end
end

if EVENT == 302 then --능력치
    Stat = StatPointFree(UID)
    if Stat == 1 then    
    RobItem(UID, 700001000, 1);
    SelectMsg(UID, 2, savenum, 4474, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    else
    Ret = 1;
    end
end

--******************************************************--
-- 재분배 끝(고급)
--******************************************************--


--******************************************************--
-- 재분배 시작(중급)

local savenum = 451
--******************************************************--
if EVENT == 700 then
    Level = CheckLevel(UID)
    if Level > 59 then -- 레벨이 60이상인가?
    SelectMsg(UID, 2, savenum, 4674, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    else 
        ITEM_COUNTA = HowmuchItem(UID, 700008000); -- 아이디 변경 아이템 
        if ITEM_COUNTA > 0 then
        SelectMsg(UID, 2, savenum, 4673, NPC, 4189, 701, 4190, 702, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
        else
        SelectMsg(UID, 2, savenum, 4672, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
        end
    end
end

local Skill
local Stat

if EVENT == 701 then --스킬
    Skill = SkillPointFree(UID)
    if Skill == 1 then    
    RobItem(UID, 700008000, 1);
    SelectMsg(UID, 2, savenum, 4473, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);   
    else
    Ret = 1;
    end
end

if EVENT == 702 then --능력치
    Stat = StatPointFree(UID)
    if Stat == 1 then    
    RobItem(UID, 700008000, 1);
    SelectMsg(UID, 2, savenum, 4474, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    else
    Ret = 1;
    end
end

--******************************************************--
-- 재분배 끝(중급)
--******************************************************--

--******************************************************--
-- 가이드북 이벤트  시작

local savenum = 428
--******************************************************--
if EVENT == 400 then
    SelectMsg(UID, 2, savenum, 4457, NPC, 4192, 401, 4191, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 401 then -- 입력 박스 
OpenEditBox(UID, 4459, 402, 403)
end

if EVENT == 402 then --실패시 
    SelectMsg(UID, 2, savenum, 4460, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 403 then --성공시 
Serial=CheckPPCardSerial(UID)
    if Serial == 1 then
    Slot = CheckGiveSlot(UID) 
        if Slot > 0 then
        GivePPCardItem(UID)
        else
        SelectMsg(UID, 2, savenum, 4645, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
        end
    else
    SelectMsg(UID, 2, savenum, 4472, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    end
end

--******************************************************--
-- 가이드북 이벤트  끝
--******************************************************--


--******************************************************--
-- 캡틴 프리미엄  시작

local savenum = 429
--******************************************************--
if EVENT == 500 then
    CheckPCBangOwner(UID, 504, 505)
end

if EVENT == 504 then --실패시 
    SelectMsg(UID, 2, savenum, 4462, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 505 then --성공시 
    SelectMsg(UID, 3, savenum, 4461, NPC, 4193, 501, 4194, 502, 4195, 503, 4196, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 501 then --복권
CheckPCBangItem(UID, 379095000, 506, 507)
end

if EVENT == 506 then --실패시 
    SelectMsg(UID, 2, savenum, 4463, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 507 then --성공시 
    SelectMsg(UID, 2, savenum, 4466, NPC, 4197, 508, 4199, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 508 then --복권
    Check = CheckGiveSlot(UID)
    if  Check > 1 then   
    GivePCBangItem(UID,379095000) 
    SelectMsg(UID, 2, savenum, 4468, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    else
    Ret = 1; 
    end  
end

if EVENT == 502 then --이벤트 아이템
    CheckPCBangItem(UID, -1, 509, 510)
end

if EVENT == 509 then --실패시 
    SelectMsg(UID, 2, savenum, 4465, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 510 then --성공시 
    SelectMsg(UID, 2, savenum, 4467, NPC, 4198, 511, 4199, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 511 then --이벤트 아이템 
    Check = CheckGiveSlot(UID, -1)
    if  Check > 1 then   
    GivePCBangItem(UID,-1)  
    SelectMsg(UID, 2, savenum, 4469, NPC, 10, 168, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    else
    Ret = 1; 
    end  
end

if EVENT == 503 then --남은 아이템 확인
ShowPCBangItem(UID, 379095000) 
end

--******************************************************--
-- 캡틴 프리미엄 끝
--******************************************************--

if EVENT == 520 then
	SelectMsg(UID, 4, 556, 6390, NPC, 4161, 116, 4162, 241, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end
