
-- [´ë»óÀÎ] Ä«ÀÌ¼¢
-- ±×³É ´İ±â 101

-- EVENT ´Â 100¹ø ÀÌ»ó ºÎÅÍ »ç¿ëÇÏ¶ó

-- UID : ¼­¹ö¿¡¼­ Á¦°øÇÏ´Â À¯Àú¹øÈ£
-- EVENT : ¼­¹ö¿¡¼­ Á¦°øÇÏ´Â Äù½ºÆ® ¹øÈ£
-- STEP : ¼­¹ö¿¡¼­ Á¦°øÇÏ´Â Äù½ºÆ® ³»ºÎ ´Ü°è

-- À§ÀÇ ¼¼°¡Áö ÆÄ¶ó¸ŞÅ¸´Â ·ç¾Æ ½ÇÇà½Ã Ç×»ó Àü¿ªº¯¼ö·Î Á¦°ø?

-- Áö¿ªº¯¼ö ¼±¾ğ...
local UserClass;
local QuestNum;
local Ret = 0;
local NPC=18004; --NPC ¹øÈ£ 


-- [´ë»óÀÎ] Ä«ÀÌ¼¢ Å¬¸¯½Ã Äù½ºÆ® Ã¼Å©  

if EVENT == 100 then
	ShowNpcEffect(UID, 31033);
	
	QuestNum = SearchQuest(UID, NPC);
		if QuestNum == 0 then --ÇØ´ç NPC¿¡°Ô ÇÒ¼ö ÀÖ´Â Äù½ºÆ®°¡ 0°³ ÀÏ¶§ 
			 SelectMsg(UID, 2, -1, 146, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
			 Ret = 1; 
		elseif QuestNum > 0 and QuestNum < 100 then--ÇØ´ç NPC¿¡°Ô ÇÒ¼ö ÀÖ´Â Äù½ºÆ®°¡ 1°³ ÀÏ¶§ 
          NpcMsg(UID, 147, NPC)
      else--ÇØ´ç NPC¿¡°Ô ÇÒ¼ö ÀÖ´Â Äù½ºÆ®°¡ 1°³ ÀÌ»ó ÀÏ¶§ 
          EVENT = QuestNum
		end
end

if EVENT == 101 then -- ±×³É ´İ±â 
    Ret = 1;
end


-----------------------------------------------------------
-- 1Â÷ ÀüÁ÷ ½ÃÀÛ 406 - EZİKLİKTEN ÇIKMA
-----------------------------------------------------------
local savenum = 406;

-- ½Ãµå¹Ì¼¿ µîÀå

if EVENT == 400 then
   Class = CheckClass(UID);
   if Class == 1 or Class == 2 or Class == 3 or Class == 4 then -- 1Â÷ ÀüÁ÷ ÀüÀÎ°¡ Ã¼Å©
      SaveEvent(UID, 4061);
      NATION = CheckNation(UID);
      if NATION == 1 then --Ä«·ç½º ÀÏ¶§ 
      SelectMsg(UID, 1, savenum, 4062, NPC, 4061, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      else -- ¿¤¸ğÀÏ¶§
      SelectMsg(UID, 1, savenum, 4063, NPC, 4061, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      end
   else
   Ret = 1;
   end
end


-- [´ë»óÀÎ] Ä«ÀÌ¼¢ 100¹øÀÇ ¼Ó¼º 0¹ø 4¹øÀÏ °æ¿ì

if EVENT == 403 then   
Level = CheckLevel(UID)
   if Level > 9 then -- ·¹º§ÀÌ 9ÀÌ»óÀÎ°¡?   
   Class = CheckClass(UID);
      if Class == 1 or Class == 2 or Class == 3 or Class == 4 then -- 1Â÷ ÀüÁ÷ ÀüÀÎ°¡ Ã¼Å©
       ITEM_COUNT = HowmuchItem(UID, 900000000);
         if ITEM_COUNT < 3000 then --³ë¾Æ°¡ 3000¾øÀ»¶§ 
         SelectMsg(UID, 2, savenum, 4065, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
         else -- 3000³ë¾Æ°¡ ÀÖÀ»¶§
         SelectMsg(UID, 2, savenum, 4064, NPC, 4062, 404, 4063, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
         end
      else --1Â÷ ÀüÁ÷À» ÀÌ¹Ì ÇßÀ»¶§
      SelectMsg(UID, 2, savenum, 4068, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      end
   else --·¹º§ÀÌ 10ÀÌÇÏÀÏ¶§ 
   SelectMsg(UID, 2, savenum, 4068, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end

if EVENT == 404 then
   SaveEvent(UID, 4063);
   PromoteUserNovice(UID)
   RobItem(UID, 900000000, 3000);
   NATION = CheckNation(UID);
   if NATION == 1 then --Ä«·ç½º ÀÏ¶§ 
   SelectMsg(UID, 1, savenum, 4066, NPC, 4064, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   else -- ¿¤¸ğÀÏ¶§
   SelectMsg(UID, 1, savenum, 4067, NPC, 4064, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end


-----------------------------------------------------------
-- 1Â÷ ÀüÁ÷ ³¡ 
-----------------------------------------------------------

-----------------------------------------------------------
-- ÀçºĞ¹è ½ÃÀÛ
-----------------------------------------------------------

local savenum = 407;

if EVENT == 407 then
   SaveEvent(UID, 4070);
   SelectMsg(UID, 2, savenum, 4070, NPC, 4070, 408, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 408 then
StatPointDistribute(UID)
end

-----------------------------------------------------------
-- ÀçºĞ¹è ³¡
-----------------------------------------------------------


-----------------------------------------------------------
-- Æê ½ÃÀÛ
-----------------------------------------------------------

local savenum = 453;


if EVENT == 500 then
   SelectMsg(UID, 3, savenum, 4704, NPC, 4238, 501, 4239, 502, 4240, 503, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end


if EVENT == 501 then
   SelectMsg(UID, 9, savenum, 4704, NPC, 4070, 408, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 502 then
   SelectMsg(UID, 9, savenum, 4704, NPC, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

if EVENT == 503 then
   SelectMsg(UID, 9, savenum, 4704, NPC, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end


-----------------------------------------------------------
-- Æê ³¡
-----------------------------------------------------------
