
-- 카루스 스파이
-- 그냥 닫기 101

-- EVENT 는 100번 이상 부터 사용하라

-- UID : 서버에서 제공하는 유저번호
-- EVENT : 서버에서 제공하는 퀘스트 번호
-- STEP : 서버에서 제공하는 퀘스트 내부 단계

-- 위의 세가지 파라메타는 루아 실행시 항상 전역변수로 제공�

-- 지역변수 선언...
local UserClass;
local QuestNum;
local Ret = 0;
local NPC= 24408; --NPC 번호 


-- 카루스 스파이 퀘스트 체크  

if EVENT == 100 then
	QuestNum = SearchQuest(UID, NPC);
		if QuestNum == 0 then --해당 NPC에게 할수 있는 퀘스트가 0개 일때 
			 SelectMsg(UID, 2, -1, 4187, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
			 Ret = 1; 
		elseif QuestNum > 1 and QuestNum < 100 then--해당 NPC에게 할수 있는 퀘스트가 1개 일때 
          NpcMsg(UID, 4188, NPC)
      else--해당 NPC에게 할수 있는 퀘스트가 1개 이상 일때 
          EVENT = QuestNum
		end
end

if EVENT == 101 then -- 그냥 닫기 
    Ret = 1;
end


-----------------------------------------------------------
-- 다크루나 시작 

local savenum = 63;
local Level
local NATION
-----------------------------------------------------------

-- 카루스 스파이  63번의 속성 0번 4번일 경우

if EVENT == 105 then
    SelectMsg(UID, 2, savenum, 4189, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

--카루스 스파이 63번의 속성 1번 3번일 경우

   local ItemA = 0;

if EVENT == 110 then 
    SelectMsg(UID, 2, savenum, 4190, NPC, 4170, 120, 4169, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end


if EVENT == 120 then 
    ItemA = HowmuchItem(UID, 910084000);  
   if  ItemA == 0 then 
    GiveItem(UID, 910084000, 1);
    SaveEvent(UID,4186);   
   else
    SelectMsg(UID, 2, savenum, 4191, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end
-----------------------------------------------------------
-- 다크루나 끝 
-----------------------------------------------------------

-----------------------------------------------------------
-- 루나 시작 
local savenum = 64;
local Level
local NATION
-----------------------------------------------------------

-- 카루스 스파이 64번의 속성 0번 4번일 경우

if EVENT == 125 then
    SelectMsg(UID, 2, savenum, 4189, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

--카루스 스파이 64번의 속성 1번 3번일 경우

local ItemA = 0;


if EVENT == 130 then 
    SelectMsg(UID, 2, savenum, 4192, NPC, 4170, 140, 4169, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end


if EVENT == 140 then 
    ItemA = HowmuchItem(UID, 910085000);  
   if  ItemA == 0 then 
    GiveItem(UID, 910085000, 1);
    SaveEvent(UID,4191);   
   else
    SelectMsg(UID, 2, savenum, 4193, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end

-----------------------------------------------------------
-- 루나 끝 
-----------------------------------------------------------
