
-- 던젼 이동 게이트 
-- 40000 대 번호 사용하고 있음 

local Num = GetEventTrigger(UID)
local NPC = 7001;
local i = 0;

if EVENT == 240 then
   EVENT =  Num
end

if EVENT == 241 then
    Ret = 1;
end

-- 던젼 이동 비석은 관련된 테이블이 있다 
-- 그테이블 이벤트 번호를 참고해 연결하고 있습니다.

--******************************************************--
-- 1차 던젼 시작	- 절망 던젼 
--******************************************************--

if Num < 41000 then -- 지옥의 심연 이동 

local	HellX = {50, 50, 50, 50, 150, 150, 150, 150, 250, 250, 250, 250, 350, 350, 350, 352, 450, 450, 450, 450}
local HellY = {74, 197, 316, 437, 118, 237, 353, 473, 77, 192, 315, 435, 117, 235, 356, 477, 76, 195, 316, 433}


if EVENT == Num then -- 지옥의 심연 이동 
ItemA = HowmuchItem(UID, 379111000);  
   if  ItemA == 0  then -- 지옥의 심연 이동키가  없을때
   EVENT =  30078
   else --지옥의 심연 이동키가 있을때 
   SelectMsg(UID, 2, -1, 40071, NPC, 40075, 30075, 40009, 30078, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end

if EVENT == 30078 then  -- 지옥의 심연 이동 ,파티단위로 이동 
    i = Num - 40001 
    if   i  < 1  then -- 1층일 때 
    SelectMsg(UID, 3, -1, 40001, NPC, 40010, 30010, 40041, 30041, 40099, 30099,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    elseif  i  > 18 then -- 20층일 때 
    SelectMsg(UID, 3, -1, 40020, NPC, 40010, 30100, 40041, 30041, 40090, 30090,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    elseif  i  == 11 or   i  == 12 or   i  == 13 or   i  == 15 or   i  == 16 then -- 던키가 필요할때 
    SelectMsg(UID, 3, -1, Num, NPC, 40010, 30011, 40041, 30041, 40090, 30090,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    else -- 다 아닐때 
    SelectMsg(UID, 3, -1, Num, NPC, 40010, 30010, 40041, 30041, 40090, 30090,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    -- 아래층으로 내려간다
    -- 텔레포트 열쇠를 사용한다.
    -- 윗층으로 올라간다.
    end
end

if EVENT == 30075 then  -- 지옥의 심연 이동 ,파티단위로 이동 
      RobItem(UID, 379111000, 1) -- 아이템 뺏기 
      ZoneChangeParty(UID, 33, 62, 91) -- 존번호, X좌표, Y좌료 
end

if EVENT == 30010 then -- 아래층으로 내려간다  개인 단위로 이동 아래층으로 이동 (열쇠 필요 x)
 i = Num - 39999
 ZoneChange(UID, 32, HellX[i], HellY[i])
end

local ItemA ;
local ItemB ;

if EVENT == 30041 then -- 텔레포트 열쇠를 사용한다.
   ItemA = HowmuchItem(UID, 379081000);  -- 절망의심연 10층열쇠
   ItemB = HowmuchItem(UID, 379082000);  -- 절망의심연 20층열쇠
      if  ItemA > 0 and  ItemB >0  then -- 텔레포트 열쇠가 다 있을때 
       SelectMsg(UID, 3, -1, 40040, NPC, 40061, 30070, 40062, 30071, 40060, 241,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      elseif ItemA > 0 and  ItemB == 0  then -- 절망의심연 10층열쇠 있을때 
       SelectMsg(UID, 2, -1, 40058, NPC, 40061, 30070, 40060, 241, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      elseif ItemA == 0 and  ItemB > 0  then -- 절망의심연 20층열쇠 있을때 
       SelectMsg(UID, 2, -1, 40056, NPC, 40062, 30071, 40060, 241, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      else -- 다 없을때 
       SelectMsg(UID, 2, -1, 40022, NPC, 10, 241, -1, -1, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      end
end

if EVENT == 30070 then -- 절망의심연 10층열쇠 있을때 
      RobItem(UID, 379081000, 1) -- 아이템 뺏기 
      ZoneChangeParty(UID, 32, 250, 192) -- 존번호, X좌표, Y좌료 
end

if EVENT == 30071 then  -- 절망의심연 20층열쇠 있을때 
      RobItem(UID, 379082000, 1) -- 아이템 뺏기 
      ZoneChangeParty(UID, 32, 450, 437) -- 존번호, X좌표, Y좌료 
end

if EVENT == 30011 then -- 아래층으로 내려간다 파티 단위로 존 이동  (열쇠 필요)
    ItemA = HowmuchItem(UID, 379080000);  
      if  ItemA > 0  then -- 던키가 있을때 
      RobAllItemParty(UID, 379080000)-- 인벤에 있는 모든 아이템 회수
       i = Num - 39999
       ZoneChangeParty(UID, 32, HellX[i], HellY[i])
      else --던키가 없을때 
       SelectMsg(UID, 2, -1, 40021, NPC, 10, 241, -1, -1, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      end
end

if EVENT == 30090 then -- 윗층으로 올라간다.
  SelectMsg(UID, 2, -1, 40090, NPC, 40090, 30395, 40099, 30099, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
 end

if EVENT == 30395 then 
 i = Num - 40001
 ZoneChange(UID, 32, HellX[i], HellY[i])
 end


if EVENT == 30099 then -- 어비스를 나간다.
ZoneChange(UID, 30, 500, 250) -- 존번호, X좌표, Y좌료 
end

if EVENT == 30100 then -- 지옥의 심연 열쇠가 필요해 
   SelectMsg(UID, 2, -1, 40070, NPC, 10, 241, -1, -1, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

--******************************************************--
-- 1차 던젼 끝 
--******************************************************--

--******************************************************--
-- 2차 던젼 시작	 - 지옥 던젼
--******************************************************--
elseif Num > 41000 and Num < 43000 then

local	HellX = {62, 62, 62, 62, 189, 189, 189, 189, 315, 315, 316, 315, 444, 444, 444, 444}
local HellY = {91, 226, 351, 477, 94, 225, 348, 458, 90, 225, 354, 475, 102, 224, 353, 458}


if EVENT == Num then --지옥 던젼 체크 
       i = Num - 42001 
         if   i  < 1  then -- 1층일 때 
         SelectMsg(UID, 3, -1, 42001, NPC, 40010, 30110, 40041, 30141, 40099, 30496,  40076, 30076, 40077, 30077, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
         elseif  i  > 14 then -- 16층일 때 
         SelectMsg(UID, 3, -1, 42016, NPC, 40041, 30141, 40090, 30190,  40076, 30076, 40077, 30077, -1, -1,-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
         elseif  i  == 10 or   i  == 12 or   i  == 13 or   i  == 14 then -- 던키가 필요할때 
         SelectMsg(UID, 3, -1, Num, NPC, 40010, 30111, 40041, 30141, 40090, 30190,  40076, 30076, 40077, 30077, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
         else -- 다 아닐때 
         SelectMsg(UID, 3, -1, Num, NPC, 40010, 30110, 40041, 30141, 40090, 30190,  40076, 30076, 40077, 30077, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
         -- 아래층으로 내려간다
         -- 텔레포트 열쇠를 사용한다.
         -- 윗층으로 올라간다.
         -- 1차 던젼 (절망의 심연 이동) 
         end
end


if EVENT == 30077 then -- 용동굴로 이동 
ItemA = HowmuchItem(UID, 389200000);  
   if  ItemA == 0  then -- 용동굴 이동 증표가 없을때 
   SelectMsg(UID, 2, -1, 43603, NPC, 10, 241, -1, -1, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   else --용동굴 이동 증표가 있을떼 
   SelectMsg(UID, 2, -1, 43602, NPC, 40077, 30112, 40060, 30077, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end


if EVENT == 30112 then  -- 용 동굴로 이동,파티단위로 이동 
      RobItem(UID, 389200000, 1) -- 아이템 뺏기 
      ZoneChangeParty(UID, 34, 112, 15) -- 존번호, X좌표, Y좌료 
end



if EVENT == 30076 then -- 1차 던젼으로 이동
ZoneChange(UID, 32, 50, 74) -- 존번호, X좌표, Y좌료 
end

if EVENT == 30110 then -- 아래층으로 내려간다  개인 단위로 이동 아래층으로 이동 (열쇠 필요 x)
 i = Num - 41999
 ZoneChange(UID, 33, HellX[i], HellY[i])
end

local ItemA ;
local ItemB ;

if EVENT == 30141 then -- 텔레포트 열쇠를 사용한다.
   ItemA = HowmuchItem(UID, 379083000);  -- 지옥의심연 8층열쇠
   ItemB = HowmuchItem(UID, 379084000);  -- 지옥의심연 16층열쇠
      if  ItemA > 0 and  ItemB >0  then -- 텔레포트 열쇠가 다 있을때 
       SelectMsg(UID, 3, -1, 40055, NPC, 40063, 30170, 40064, 30171, 40060, 241,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      elseif ItemA > 0 and  ItemB == 0  then -- 지옥의심연 8층열쇠
       SelectMsg(UID, 2, -1, 40054, NPC, 40063, 30170, 40060, 241, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      elseif ItemA == 0 and  ItemB > 0  then -- 지옥의심연 16층열쇠 있을때 
       SelectMsg(UID, 2, -1, 40052, NPC, 40064, 30171, 40060, 241, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      else -- 다 없을때 
       SelectMsg(UID, 2, -1, 40022, NPC, 10, 241, -1, -1, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      end
end

if EVENT == 30170 then -- 지옥의심연 8층열쇠 있을때 
      RobItem(UID, 379083000, 1) -- 아이템 뺏기 
      ZoneChangeParty(UID, 33, 189, 458) -- 존번호, X좌표, Y좌료 
end

if EVENT == 30171 then   -- 지옥의심연 16층열쇠 있을때 
      RobItem(UID, 379084000, 1) -- 아이템 뺏기 
      ZoneChangeParty(UID, 33, 444, 458) -- 존번호, X좌표, Y좌료 
end


if EVENT == 30111 then -- 아래층으로 내려간다 파티 단위로 존 이동  (열쇠 필요)
    ItemA = HowmuchItem(UID, 379080000);  
      if  ItemA > 0  then -- 던키가 있을때 
      RobItem(UID, 379080000, 1) -- 아이템 뺏기
       i = Num - 41999
       ZoneChangeParty(UID, 33, HellX[i], HellY[i])
      else --던키가 없을때 
       SelectMsg(UID, 2, -1, 40021, NPC, 10, 241, -1, -1, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
      end
end

if EVENT == 30190 then -- 윗층으로 올라간다.
  SelectMsg(UID, 2, -1, 40090, NPC, 40090, 30495, 40099, 30496, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
 end

if EVENT == 30495 then 
 i = Num - 42001
 ZoneChange(UID, 33, HellX[i], HellY[i])
 end
 
 if EVENT == 30496 then -- 어비스를 나간다.
ZoneChange(UID, 30, 500, 250) -- 존번호, X좌표, Y좌료 
end


--******************************************************--
-- 2차 던젼 끝 
--******************************************************--



--******************************************************--
-- 용존 입장 시작 
--******************************************************--
else

if EVENT == 43601 then 
    SelectMsg(UID, 3, -1, 43601, NPC, 4071, 30096,  4072, 241, -1, -1,  -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
    -- 2차 던젼으로 이동한다.
    -- 그냥 있는다.
end


if EVENT == 30096 then -- 2차 던젼 20층으로 이동 
ZoneChange(UID, 33, 445, 459) -- 존번호, X좌표, Y좌료 
end


end

--******************************************************--
-- 용존 입장 끝 
--******************************************************--


return Ret;